export const normal_rare_header = [
    "名称",
    "喜好·料理",
    "喜好·酒水",
    "出没地点"
]

export const normal_rare_results = [
    {
        "名称": "妖怪兔",
        "喜好·料理": "招牌、家常、甜、咸、鲜、果味、凉爽、力量涌现、流行·喜爱",
        "喜好·酒水": "无酒精",
        "出没地点": "妖怪兽道、红魔馆、迷途竹林、魔法森林、妖怪之山、地灵殿"
    },
    {
        "名称": "妖怪猫",
        "喜好·料理": "招牌、肉、海味、凉爽、中华、流行·喜爱",
        "喜好·酒水": "可加冰、啤酒、苦",
        "出没地点": "妖怪兽道、博丽神社、红魔馆、迷途竹林、魔法森林、妖怪之山、地灵殿"
    },
    {
        "名称": "妖怪狸",
        "喜好·料理": "招牌、肉、饱腹、重油、咸、山珍、流行·喜爱",
        "喜好·酒水": "甘、辛",
        "出没地点": "妖怪兽道、博丽神社、红魔馆、迷途竹林、魔法森林、妖怪之山、命莲寺"
    },
    {
        "名称": "妖怪狐",
        "喜好·料理": "招牌、肉、小巧、和风、中华、流行·喜爱",
        "喜好·酒水": "直饮",
        "出没地点": "妖怪兽道、红魔馆、迷途竹林、妖怪之山、旧地狱"
    },
    {
        "名称": "蟒蛇精",
        "喜好·料理": "肉、下酒、山珍、力量涌现、流行·喜爱",
        "喜好·酒水": "清酒、烧酒",
        "出没地点": "妖怪兽道、妖怪之山、旧地狱"
    },
    {
        "名称": "人类小孩",
        "喜好·料理": "招牌、家常、肉、饱腹、甜、咸、凉爽、中华、流行·喜爱",
        "喜好·酒水": "无酒精",
        "出没地点": "人间之里"
    },
    {
        "名称": "人类男性",
        "喜好·料理": "肉、下酒、咸、鲜、灼热、文化底蕴、和风、流行·喜爱",
        "喜好·酒水": "可加热、烧酒",
        "出没地点": "人间之里、命莲寺、神灵庙"
    },
    {
        "名称": "人类女性",
        "喜好·料理": "招牌、水产、高级、咸、鲜、凉爽、流行·喜爱",
        "喜好·酒水": "可加冰",
        "出没地点": "人间之里、博丽神社、命莲寺、神灵庙"
    },
    {
        "名称": "人类长者",
        "喜好·料理": "招牌、高级、灼热、适合拍照、流行·喜爱",
        "喜好·酒水": "低酒精",
        "出没地点": "人间之里、博丽神社、神灵庙"
    },
    {
        "名称": "左卫门",
        "喜好·料理": "高级、生、猎奇、力量涌现、流行·喜爱",
        "喜好·酒水": "高酒精",
        "出没地点": "人间之里、博丽神社"
    },
    {
        "名称": "座敷童子",
        "喜好·料理": "招牌、甜、生、山珍、凉爽、和风、流行·喜爱",
        "喜好·酒水": "无酒精、低酒精",
        "出没地点": "博丽神社"
    },
    {
        "名称": "河童",
        "喜好·料理": "招牌、大份、小巧、高级、海味、猎奇、灼热、流行·喜爱",
        "喜好·酒水": "甘",
        "出没地点": "博丽神社、红魔馆、魔法森林、妖怪之山"
    },
    {
        "名称": "鸦天狗",
        "喜好·料理": "招牌、高级、适合拍照、菌类、流行·喜爱",
        "喜好·酒水": "清酒、烧酒",
        "出没地点": "博丽神社、红魔馆、迷途竹林、妖怪之山"
    },
    {
        "名称": "妖精",
        "喜好·料理": "甜、鲜、果味、梦幻、适合拍照、菌类、特产、流行·喜爱",
        "喜好·酒水": "气泡、水果、直饮、甘",
        "出没地点": "红魔馆、迷途竹林、魔法森林"
    },
    {
        "名称": "魔法使【DLC1】",
        "喜好·料理": "家常、素、清淡、高级、传说、鲜、凉爽、适合拍照、西式、流行·喜爱",
        "喜好·酒水": "可加热、西洋酒、鸡尾酒、提神",
        "出没地点": "魔法森林"
    },
    {
        "名称": "森之妖精【DLC1】",
        "喜好·料理": "招牌、家常、小巧、甜、鲜、凉爽、梦幻、和风、中华、流行·喜爱",
        "喜好·酒水": "无酒精、低酒精、清酒、水果、甘",
        "出没地点": "魔法森林"
    },
    {
        "名称": "谜之人形【DLC1】",
        "喜好·料理": "家常、小巧、咸、生、梦幻、猎奇、适合拍照、菌类、流行·喜爱",
        "喜好·酒水": "气泡、水果、提神、苦",
        "出没地点": "魔法森林"
    },
    {
        "名称": "山姥【DLC1】",
        "喜好·料理": "家常、肉、饱腹、高级、鲜、猎奇、力量涌现、流行·喜爱",
        "喜好·酒水": "高酒精、烧酒、古典、直饮",
        "出没地点": "妖怪之山"
    },
    {
        "名称": "山童【DLC1】",
        "喜好·料理": "招牌、大份、小巧、高级、山珍、猎奇、灼热、流行·喜爱",
        "喜好·酒水": "中酒精、苦",
        "出没地点": "妖怪之山"
    },
    {
        "名称": "白狼天狗【DLC1】",
        "喜好·料理": "招牌、肉、饱腹、重油、咸、鲜、生、山珍、特产、流行·喜爱",
        "喜好·酒水": "中酒精、高酒精、清酒、烧酒",
        "出没地点": "妖怪之山"
    },
    {
        "名称": "土蜘蛛【DLC2】",
        "喜好·料理": "肉、饱腹、重油、大份、甜、鲜、生、山珍、猎奇、流行·喜爱",
        "喜好·酒水": "中酒精、可加冰、利口酒、现代、直饮、甘、苦",
        "出没地点": "旧地狱"
    },
    {
        "名称": "鬼【DLC2】",
        "喜好·料理": "肉、下酒、高级、传说、鲜、力量涌现、燃起来了、特产、流行·喜爱",
        "喜好·酒水": "中酒精、高酒精、烧酒、直饮",
        "出没地点": "旧地狱"
    },
    {
        "名称": "骨女【DLC2】",
        "喜好·料理": "素、清淡、酸、鲜、生、凉爽、猎奇、菌类、流行·喜爱",
        "喜好·酒水": "低酒精、可加热、啤酒、水果、苦",
        "出没地点": "旧地狱"
    },
    {
        "名称": "地狱鸦【DLC2】",
        "喜好·料理": "家常、肉、小巧、酸、咸、山珍、海味、燃起来了、流行·喜爱",
        "喜好·酒水": "中酒精、可加热、啤酒、苦、辛",
        "出没地点": "地灵殿"
    },
    {
        "名称": "姑获鸟【DLC2】",
        "喜好·料理": "家常、水产、清淡、酸、鲜、猎奇、文化底蕴、流行·喜爱",
        "喜好·酒水": "低酒精、可加热、烧酒、苦",
        "出没地点": "地灵殿"
    },
    {
        "名称": "豹女【DLC2】",
        "喜好·料理": "肉、重油、高级、生、山珍、海味、灼热、特产、流行·喜爱",
        "喜好·酒水": "中酒精、高酒精、直饮、辛",
        "出没地点": "地灵殿"
    },
    {
        "名称": "地精",
        "喜好·料理": "重油、高级、山珍、凉爽、灼热、力量涌现、流行·喜爱",
        "喜好·酒水": "清酒、西洋酒",
        "出没地点": "爱丽丝奖励符卡召唤"
    },
    {
        "名称": "僧侣【DLC3】",
        "喜好·料理": "家常、肉、下酒、山珍、力量涌现、流行·喜爱",
        "喜好·酒水": "中酒精、高酒精、可加热、烧酒、古典",
        "出没地点": "命莲寺"
    },
    {
        "名称": "妖怪鼠【DLC3】",
        "喜好·料理": "家常、大份、高级、果味、梦幻、流行·喜爱",
        "喜好·酒水": "利口酒、鸡尾酒、现代、水果、甘",
        "出没地点": "命莲寺"
    },
    {
        "名称": "八尺大人【DLC3】",
        "喜好·料理": "鲜、凉爽、适合拍照、和风、西式、流行·喜爱",
        "喜好·酒水": "低酒精、可加冰、利口酒、西洋酒、鸡尾酒",
        "出没地点": "命莲寺"
    },
    {
        "名称": "道士【DLC3】",
        "喜好·料理": "招牌、家常、清淡、小巧、山珍、特产、流行·喜爱",
        "喜好·酒水": "低酒精、现代、提神、苦",
        "出没地点": "神灵庙"
    },
    {
        "名称": "僵尸【DLC3】",
        "喜好·料理": "全部",
        "喜好·酒水": "全部",
        "出没地点": "神灵庙"
    },
    {
        "名称": "仙人【DLC3】",
        "喜好·料理": "素、清淡、小巧、高级、果味、梦幻、流行·喜爱",
        "喜好·酒水": "低酒精、清酒、古典、气泡、水果、甘",
        "出没地点": "神灵庙"
    }
]