export const custom_rare_header = [
    "名称",
    "携带金额",
    "喜好·料理",
    "喜好·酒水",
    "厌恶·料理",
    "出没地点（非邀请状态下三级店）"
]

export const custom_rare_results = [
    {
        "名称": "莉格露",
        "携带金额": "200－400",
        "喜好·料理": "肉、甜、生、猎奇",
        "喜好·酒水": "低酒精、可加冰",
        "厌恶·料理": "素、清淡、凉爽",
        "出没地点（非邀请状态下三级店）": "妖怪兽道、魔法森林"
    },
    {
        "名称": "橙",
        "携带金额": "400－600",
        "喜好·料理": "肉、水产、重油、甜、烧烤、流行·喜爱",
        "喜好·酒水": "水果、辛",
        "厌恶·料理": "素、猎奇、灼热、流行·厌恶",
        "出没地点（非邀请状态下三级店）": "妖怪兽道"
    },
    {
        "名称": "露米娅",
        "携带金额": "150－350",
        "喜好·料理": "招牌、肉、饱腹、生、猎奇、流行·喜爱",
        "喜好·酒水": "气泡、苦",
        "厌恶·料理": "昂贵、下酒、流行·厌恶",
        "出没地点（非邀请状态下三级店）": "妖怪兽道、魔法森林"
    },
    {
        "名称": "稗田阿求",
        "携带金额": "500－800",
        "喜好·料理": "清淡、高级、甜、文化底蕴、汤羹、和风、流行·喜爱",
        "喜好·酒水": "可加热、清酒",
        "厌恶·料理": "重油、咸、灼热、流行·厌恶",
        "出没地点（非邀请状态下三级店）": "人间之里、命莲寺"
    },
    {
        "名称": "茨木华扇",
        "携带金额": "400－600",
        "喜好·料理": "家常、下酒、文化底蕴、和风",
        "喜好·酒水": "中酒精、古典、直饮",
        "厌恶·料理": "实惠、辣、生",
        "出没地点（非邀请状态下三级店）": "人间之里、旧地狱、神灵庙"
    },
    {
        "名称": "上白泽慧音",
        "携带金额": "400－800",
        "喜好·料理": "家常、素、清淡、文化底蕴、和风、中华、流行·喜爱",
        "喜好·酒水": "清酒、烧酒、利口酒",
        "厌恶·料理": "重油、大份、咸、流行·厌恶",
        "出没地点（非邀请状态下三级店）": "人间之里、魔法森林、命莲寺"
    },
    {
        "名称": "森近霖之助",
        "携带金额": "250－400",
        "喜好·料理": "家常、饱腹、鲜、流行·喜爱",
        "喜好·酒水": "啤酒、烧酒",
        "厌恶·料理": "下酒、重油、猎奇、流行·厌恶",
        "出没地点（非邀请状态下三级店）": "人间之里"
    },
    {
        "名称": "魂魄妖梦（剧情）",
        "携带金额": "－",
        "喜好·料理": "传说、和风",
        "喜好·酒水": "直饮",
        "厌恶·料理": "－",
        "出没地点（非邀请状态下三级店）": "人间之里"
    },
    {
        "名称": "伊吹萃香",
        "携带金额": "600－800",
        "喜好·料理": "肉、下酒、小巧、力量涌现、和风、流行·喜爱",
        "喜好·酒水": "高酒精、直饮",
        "厌恶·料理": "重油、流行·厌恶",
        "出没地点（非邀请状态下三级店）": "博丽神社、妖怪之山"
    },
    {
        "名称": "比那名居天子",
        "携带金额": "2000－3000",
        "喜好·料理": "昂贵、素、清淡、传说、甜、果味、适合拍照、流行·厌恶",
        "喜好·酒水": "高酒精、鸡尾酒",
        "厌恶·料理": "家常、肉、重油、流行·喜爱",
        "出没地点（非邀请状态下三级店）": "博丽神社、妖怪之山、旧地狱、神灵庙"
    },
    {
        "名称": "博丽灵梦",
        "携带金额": "150－300",
        "喜好·料理": "实惠、饱腹、高级、甜、不可思议、流行·喜爱",
        "喜好·酒水": "无酒精、低酒精、可加热",
        "厌恶·料理": "昂贵、下酒、流行·厌恶",
        "出没地点（非邀请状态下三级店）": "博丽神社、妖怪兽道、人间之里、魔法森林、妖怪之山"
    },
    {
        "名称": "琪露诺",
        "携带金额": "100－200",
        "喜好·料理": "甜、凉爽、猎奇、适合拍照、流行·厌恶",
        "喜好·酒水": "可加冰、水果、甘",
        "厌恶·料理": "昂贵、下酒、文化底蕴、流行·喜爱",
        "出没地点（非邀请状态下三级店）": "红魔馆、妖怪之山"
    },
    {
        "名称": "红美铃",
        "携带金额": "200－400",
        "喜好·料理": "肉、饱腹、力量涌现、中华、流行·喜爱",
        "喜好·酒水": "可加热、古典、提神",
        "厌恶·料理": "果味、猎奇、西式、流行·厌恶",
        "出没地点（非邀请状态下三级店）": "红魔馆"
    },
    {
        "名称": "帕秋莉",
        "携带金额": "600－1000",
        "喜好·料理": "高级、甜、梦幻、适合拍照、西式",
        "喜好·酒水": "利口酒、鸡尾酒、气泡",
        "厌恶·料理": "咸、生、猎奇、灼热",
        "出没地点（非邀请状态下三级店）": "红魔馆、魔法森林、地灵殿"
    },
    {
        "名称": "蕾米莉亚",
        "携带金额": "－",
        "喜好·料理": "高级、甜、生、西式",
        "喜好·酒水": "西洋酒、古典、水果、甘",
        "厌恶·料理": "－",
        "出没地点（非邀请状态下三级店）": "红魔馆"
    },
    {
        "名称": "藤原妹红",
        "携带金额": "300－600",
        "喜好·料理": "辣、果味、灼热、燃起来了",
        "喜好·酒水": "烧酒、苦、辛",
        "厌恶·料理": "昂贵、高级、不可思议",
        "出没地点（非邀请状态下三级店）": "迷途竹林、妖怪兽道"
    },
    {
        "名称": "因幡帝",
        "携带金额": "200－400",
        "喜好·料理": "小巧、传说、甜、凉爽、梦幻、流行·喜爱",
        "喜好·酒水": "无酒精、水果、甘",
        "厌恶·料理": "重油、山珍、猎奇、流行·厌恶",
        "出没地点（非邀请状态下三级店）": "迷途竹林，（奸商）博丽神社、红魔馆、迷途竹林、魔法森林、妖怪之山、旧地狱、地灵殿"
    },
    {
        "名称": "蓬莱山辉夜",
        "携带金额": "1000－1500",
        "喜好·料理": "传说、不可思议、文化底蕴、和风、流行·喜爱",
        "喜好·酒水": "清酒、古典、现代",
        "厌恶·料理": "招牌、大份、猎奇、流行·厌恶",
        "出没地点（非邀请状态下三级店）": "迷途竹林"
    },
    {
        "名称": "爱丽丝【DLC1】",
        "携带金额": "500－800",
        "喜好·料理": "家常、高级、甜、文化底蕴、西式",
        "喜好·酒水": "低酒精、西洋酒、现代",
        "厌恶·料理": "肉、饱腹、重油、猎奇",
        "出没地点（非邀请状态下三级店）": "魔法森林"
    },
    {
        "名称": "矢田寺成美【DLC1】",
        "携带金额": "300－600",
        "喜好·料理": "清淡、山珍、文化底蕴、特产、和风",
        "喜好·酒水": "低酒精、中酒精、可加冰、古典、直饮",
        "厌恶·料理": "饱腹、重油",
        "出没地点（非邀请状态下三级店）": "魔法森林、命莲寺"
    },
    {
        "名称": "雾雨魔理沙",
        "携带金额": "3000－5000",
        "喜好·料理": "重油、传说、灼热、菌类、和风、流行·喜爱",
        "喜好·酒水": "低酒精、可加冰",
        "厌恶·料理": "猎奇、流行·厌恶",
        "出没地点（非邀请状态下三级店）": "魔法森林、妖怪兽道、人间之里、博丽神社、红魔馆、迷途竹林、妖怪之山、旧地狱、地灵殿、命莲寺、神灵庙"
    },
    {
        "名称": "犬走椛【DLC1】",
        "携带金额": "300－400",
        "喜好·料理": "肉、下酒、重油、大份、山珍",
        "喜好·酒水": "中酒精、高酒精、直饮",
        "厌恶·料理": "素、清淡、猎奇",
        "出没地点（非邀请状态下三级店）": "妖怪之山"
    },
    {
        "名称": "河城荷取【DLC1】",
        "携带金额": "400－500",
        "喜好·料理": "招牌、水产、下酒、高级、咸、猎奇",
        "喜好·酒水": "中酒精、高酒精、清酒、直饮",
        "厌恶·料理": "素、山珍、文化底蕴",
        "出没地点（非邀请状态下三级店）": "妖怪之山"
    },
    {
        "名称": "东风谷早苗【DLC1】",
        "携带金额": "400－600",
        "喜好·料理": "家常、甜、梦幻、适合拍照、和风、流行·喜爱",
        "喜好·酒水": "无酒精、低酒精、清酒、现代、气泡、水果、直饮、甘、苦",
        "厌恶·料理": "重油、生、猎奇、灼热",
        "出没地点（非邀请状态下三级店）": "妖怪之山、魔法森林、命莲寺、神灵庙"
    },
    {
        "名称": "黑谷山女【DLC2】",
        "携带金额": "250－400",
        "喜好·料理": "甜、鲜、生、猎奇、适合拍照、流行·喜爱",
        "喜好·酒水": "低酒精、中酒精、啤酒、甘",
        "厌恶·料理": "重油、咸、灼热",
        "出没地点（非邀请状态下三级店）": "旧地狱、妖怪兽道、红魔馆、魔法森林、妖怪之山"
    },
    {
        "名称": "水桥帕露西【DLC2】",
        "携带金额": "300－400",
        "喜好·料理": "肉、酸、辣、咸、鲜、果味、流行·厌恶",
        "喜好·酒水": "无酒精、可加热、直饮、苦、辛",
        "厌恶·料理": "甜、流行·喜爱",
        "出没地点（非邀请状态下三级店）": "旧地狱"
    },
    {
        "名称": "星熊勇仪【DLC2】",
        "携带金额": "600－1000",
        "喜好·料理": "招牌、下酒、大份、传说、力量涌现、燃起来了、和风、流行·喜爱",
        "喜好·酒水": "高酒精、啤酒、清酒、古典",
        "厌恶·料理": "素、小巧、猎奇",
        "出没地点（非邀请状态下三级店）": "旧地狱、博丽神社、妖怪之山、地灵殿"
    },
    {
        "名称": "火焰猫燐【DLC2】",
        "携带金额": "500－700",
        "喜好·料理": "水产、甜、鲜、海味、梦幻、猎奇、流行·喜爱",
        "喜好·酒水": "低酒精、清酒、水果",
        "厌恶·料理": "生、灼热",
        "出没地点（非邀请状态下三级店）": "地灵殿、人间之里、博丽神社、妖怪之山、旧地狱、命莲寺、神灵庙"
    },
    {
        "名称": "古明地觉【DLC2】",
        "携带金额": "500－600",
        "喜好·料理": "家常、小巧、甜、梦幻、力量涌现、特产",
        "喜好·酒水": "无酒精、气泡、提神、苦",
        "厌恶·料理": "肉、大份、山珍、猎奇、灼热",
        "出没地点（非邀请状态下三级店）": "地灵殿、人间之里、博丽神社、红魔馆、迷途竹林、魔法森林"
    },
    {
        "名称": "灵乌路空【DLC2】",
        "携带金额": "500－800",
        "喜好·料理": "肉、重油、辣、咸、灼热、力量涌现",
        "喜好·酒水": "中酒精、可加热、鸡尾酒",
        "厌恶·料理": "清淡、菌类",
        "出没地点（非邀请状态下三级店）": "地灵殿、妖怪之山"
    },
    {
        "名称": "魂魄妖梦",
        "携带金额": "300－400",
        "喜好·料理": "家常、清淡、鲜、力量涌现",
        "喜好·酒水": "无酒精、可加热、水果",
        "厌恶·料理": "重油、猎奇",
        "出没地点（非邀请状态下三级店）": "妖怪兽道、人间之里、博丽神社、迷途竹林"
    },
    {
        "名称": "西行寺幽幽子",
        "携带金额": "1300－1800",
        "喜好·料理": "肉、水产、饱腹、大份、高级、传说、和风、中华",
        "喜好·酒水": "高酒精、可加冰、鸡尾酒",
        "厌恶·料理": "素、清淡、小巧",
        "出没地点（非邀请状态下三级店）": "博丽神社、红魔馆、迷途竹林、神灵庙"
    },
    {
        "名称": "饕餮尤魔【DLC1】",
        "携带金额": "9999－9999",
        "喜好·料理": "肉、饱腹、大份、高级、传说、鲜、生、不可思议、力量涌现",
        "喜好·酒水": "高酒精、烧酒、直饮、辛",
        "厌恶·料理": "－",
        "出没地点（非邀请状态下三级店）": "妖怪之山、妖怪兽道、博丽神社、红魔馆、迷途竹林、魔法森林、旧地狱、地灵殿、命莲寺、神灵庙"
    },
    {
        "名称": "古明地恋【DLC2】",
        "携带金额": "800－1200",
        "喜好·料理": "甜、咸、生、梦幻、猎奇、不可思议、流行·厌恶",
        "喜好·酒水": "高酒精、烧酒、气泡、苦",
        "厌恶·料理": "－",
        "出没地点（非邀请状态下三级店）": "地灵殿、妖怪兽道、人间之里、博丽神社、红魔馆、迷途竹林、魔法森林、妖怪之山、旧地狱、命莲寺、神灵庙"
    },
    {
        "名称": "萌澄果",
        "携带金额": "1200－1600",
        "喜好·料理": "肉、水产、甜、梦幻、流行·喜爱",
        "喜好·酒水": "可加冰、水果、甘、辛",
        "厌恶·料理": "猎奇、灼热、流行·厌恶",
        "出没地点（非邀请状态下三级店）": "妖怪兽道、人间之里、博丽神社、红魔馆、迷途竹林、魔法森林、妖怪之山、命莲寺、神灵庙"
    },
    {
        "名称": "蹦蹦跳跳的三妖精",
        "携带金额": "300－400",
        "喜好·料理": "家常、小巧、甜、凉爽、梦幻、菌类、流行·喜爱",
        "喜好·酒水": "无酒精、水果、甘、苦",
        "厌恶·料理": "生、猎奇、灼热、流行·厌恶",
        "出没地点（非邀请状态下三级店）": "妖怪兽道、人间之里、博丽神社、红魔馆、迷途竹林、妖怪之山"
    },
    {
        "名称": "冴月麟",
        "携带金额": "400－600",
        "喜好·料理": "家常、水产、辣、中华、流行·喜爱",
        "喜好·酒水": "无酒精、气泡、甘",
        "厌恶·料理": "下酒、重油、生、流行·厌恶",
        "出没地点（非邀请状态下三级店）": "妖怪兽道、人间之里、博丽神社、红魔馆、迷途竹林"
    },
    {
        "名称": "立空汐",
        "携带金额": "500－800",
        "喜好·料理": "昂贵、肉、下酒、山珍、力量涌现、和风、流行·厌恶",
        "喜好·酒水": "高酒精、可加冰、可加热",
        "厌恶·料理": "素、清淡、流行·喜爱",
        "出没地点（非邀请状态下三级店）": "妖怪兽道、博丽神社、红魔馆、迷途竹林、妖怪之山"
    },
    {
        "名称": "时焉侑",
        "携带金额": "1300－1800",
        "喜好·料理": "下酒、传说、文化底蕴、特产、西式、中华",
        "喜好·酒水": "中酒精、可加冰、西洋酒、鸡尾酒",
        "厌恶·料理": "水产、饱腹、重油",
        "出没地点（非邀请状态下三级店）": "人间之里、博丽神社"
    },
    {
        "名称": "摩多罗隐岐奈【DLC2.5】",
        "携带金额": "－",
        "喜好·料理": "－",
        "喜好·酒水": "－",
        "厌恶·料理": "－",
        "出没地点（非邀请状态下三级店）": "－"
    }
]