  // 菜譜
export var meal = {
    "海鲜味噌汤" : {
        provide : ["实惠", "素", "家常", "汤羹"],
        conflict : ["重油"],
        need : ["海苔"],
        price : 8
    },
    "烤八目鳗" : {
        provide : ["水产", "招牌", "烧烤"],
        conflict : ["肉", "素"],
        need : ["八目鳗"],
        price : 22
    },
    "冷豆腐" : {
        provide : ["素", "家常", "清淡", "下酒", "小巧"],
        conflict : [],
        need : ["萝卜", "豆腐"],
        price : 21
    },
    "饭团" : {
        provide : ["实惠", "素", "家常", "饱腹", "和风"],
        conflict : [],
        need : ["海苔"],
        price : 6
    },
    "煮豆腐" : {
        provide : ["素", "家常", "清淡"],
        conflict : [],
        need : ["豆腐"],
        price : 22
    },
    "臭豆腐" : {
        provide : ["素", "中华", "猎奇", "辣"],
        conflict : ["甜", "果味"],
        need : ["豆腐", "辣椒"],
        price : 24
    },
    "秘制小鱼干" : {
        provide : ["水产", "咸", "鲜", "小巧"],
        conflict : [],
        need : ["鳟鱼"],
        price : 30
    },
    "露水煮蛋" : {
        provide : ["实惠", "清淡", "生"],
        conflict : ["肉", "水产", "重油"],
        need : ["露水", "鸡蛋"],
        price : 18
    },
    "毛玉三色冰激凌" : {
        provide : ["昂贵", "西式", "甜", "适合拍照", "凉爽", "梦幻"],
        conflict : [],
        need : ["露水", "豆腐", "蜂蜜", "鸡蛋"],
        price : 75
    },
    "毛玉熔岩豆腐" : {
        provide : ["昂贵", "素", "中华", "鲜", "适合拍照", "不可思议"],
        conflict : [],
        need : ["豆腐", "辣椒", "牛肉", "洋葱"],
        price : 85
    },
    "烤蘑菇" : {
        provide : ["实惠", "素", "咸", "灼热", "菌类", "烧烤"],
        conflict : [],
        need : ["蘑菇"],
        price : 18
    },
    "猪肉盖浇饭" : {
        provide : ["肉", "家常", "饱腹"],
        conflict : [],
        need : ["猪肉"],
        price : 20
    },
    "炸八目鳗" : {
        provide : ["水产", "重油", "招牌"],
        conflict : ["凉爽"],
        need : ["八目鳗"],
        price : 27
    },
    "猪肉鳟鱼熏" : {
        provide : ["肉", "水产", "家常", "烧烤"],
        conflict : ["凉爽"],
        need : ["猪肉", "鳟鱼"],
        price : 26
    },
    "香炸蝉蜕" : {
        provide : ["实惠", "重油", "猎奇"],
        conflict : [],
        need : ["蝉蜕"],
        price : 19
    },
    "土豆可乐饼" : {
        provide : ["素", "家常", "重油"],
        conflict : ["凉爽"],
        need : ["土豆"],
        price : 22
    },
    "豚骨拉面" : {
        provide : ["肉", "家常", "饱腹", "咸"],
        conflict : [],
        need : ["猪肉", "豆腐", "洋葱"],
        price : 60
    },
    "力量汤" : {
        provide : ["肉", "山珍", "灼热", "力量涌现", "汤羹"],
        conflict : ["小巧", "凉爽"],
        need : ["野猪肉", "海苔"],
        price : 34
    },
    "赛熊掌" : {
        provide : ["昂贵", "肉", "水产", "高级", "山珍", "鲜", "力量涌现", "不可思议"],
        conflict : ["小巧", "凉爽"],
        need : ["黑毛猪肉", "竹笋", "河豚"],
        price : 70
    },
    "幻昙花糕" : {
        provide : ["昂贵", "高级", "传说", "甜", "适合拍照", "梦幻"],
        conflict : ["肉", "水产"],
        need : ["幻昙华", "露水"],
        price : 78
    },
    "猩红恶魔蛋糕" : {
        provide : ["西式", "甜", "适合拍照", "猎奇", "梦幻"],
        conflict : [],
        need : ["露水", "南瓜", "土豆", "蜂蜜"],
        price : 60
    },
    "无意识妖怪慕斯" : {
        provide : ["高级", "西式", "甜", "适合拍照", "梦幻"],
        conflict : [],
        need : ["豆腐", "黄油", "蜂蜜", "洋葱"],
        price : 60
    },
    "油豆腐" : {
        provide : ["实惠", "素", "家常", "重油", "和风"],
        conflict : [],
        need : ["豆腐"],
        price : 16
    },
    "豆腐味噌" : {
        provide : ["素", "家常", "清淡", "和风", "汤羹"],
        conflict : ["重油"],
        need : ["豆腐"],
        price : 21
    },
    "豆腐锅" : {
        provide : ["实惠", "素", "清淡", "和风", "灼热"],
        conflict : [],
        need : ["豆腐"],
        price : 21
    },
    "诗礼银杏" : {
        provide : ["素", "中华", "甜", "文化底蕴"],
        conflict : ["咸"],
        need : ["白果", "蜂蜜"],
        price : 60
    },
    "蔬菜专辑" : {
        provide : ["素", "清淡", "生", "凉爽"],
        conflict : ["肉", "水产", "灼热"],
        need : ["土豆", "洋葱", "南瓜"],
        price : 56
    },
    "牛肉盖浇饭" : {
        provide : ["肉", "家常", "饱腹"],
        conflict : [],
        need : ["牛肉"],
        price : 20
    },
    "炙猪肉饭团" : {
        provide : ["实惠", "肉", "家常", "饱腹"],
        conflict : [],
        need : ["猪肉"],
        price : 14
    },
    "野味加农" : {
        provide : ["昂贵", "肉", "重油", "饱腹", "山珍", "灼热"],
        conflict : [],
        need : ["土豆", "南瓜", "黑毛猪肉"],
        price : 66
    },
    "白雪" : {
        provide : ["昂贵", "肉", "水产", "高级", "和风", "文化底蕴"],
        conflict : [],
        need : ["河豚", "八目鳗", "海苔"],
        price : 98
    },
    "樱落雪" : {
        provide : ["水产", "高级", "海味", "和风", "生", "适合拍照", "小巧"],
        conflict : ["重油"],
        need : ["极上金枪鱼"],
        price : 50
    },
    "凉菜雕花" : {
        provide : ["素", "清淡", "适合拍照", "凉爽"],
        conflict : ["肉", "灼热"],
        need : ["萝卜"],
        price : 20
    },
    "温暖饭团" : {
        provide : ["水产", "素", "家常", "饱腹", "和风", "灼热"],
        conflict : [],
        need : ["洋葱", "鳟鱼"],
        price : 30
    },
    "汤圆" : {
        provide : ["素", "家常", "中华", "文化底蕴"],
        conflict : [],
        need : ["糯米"],
        price : 35
    },
    "炸猪猪排" : {
        provide : ["肉", "家常", "重油", "饱腹"],
        conflict : [],
        need : ["猪肉"],
        price : 25
    },
    "炒肉丝" : {
        provide : ["实惠", "肉", "家常", "重油", "下酒", "中华"],
        conflict : [],
        need : ["猪肉"],
        price : 15
    },
    "水饺" : {
        provide : ["素", "家常", "中华", "文化底蕴"],
        conflict : [],
        need : ["面粉"],
        price : 35
    },
    "杂烩" : {
        provide : ["肉", "家常", "鲜", "灼热"],
        conflict : [],
        need : ["海苔", "豆腐", "鳟鱼"],
        price : 35
    },
    "桃花羹" : {
        provide : ["素", "甜", "适合拍照", "凉爽", "果味", "汤羹"],
        conflict : [],
        need : ["桃子", "冰块", "露水"],
        price : 55
    },
    "能量串" : {
        provide : ["肉", "饱腹", "烧烤"],
        conflict : [],
        need : ["牛肉", "洋葱", "南瓜"],
        price : 50
    },
    "大奢宴" : {
        provide : ["昂贵", "肉", "水产", "高级", "饱腹", "山珍"],
        conflict : ["家常", "实惠"],
        need : ["黑毛猪肉", "和牛", "河豚"],
        price : 105
    },
    "二天一流" : {
        provide : ["昂贵", "肉", "高级", "山珍", "文化底蕴", "烧烤", "燃起来了"],
        conflict : ["家常"],
        need : ["黑毛猪肉", "野猪肉"],
        price : 90
    },
    "北极甜虾蜜桃色拉" : {
        provide : ["水产", "素", "清淡", "甜", "适合拍照", "不可思议", "果味"],
        conflict : ["咸", "肉"],
        need : ["桃子", "冰块", "虾"],
        price : 25
    },
}

// 原料 这里的 price 应该是通常途径获取时所需的价格
export var ingredients = {
    "海苔" : {
        provide : ["鲜", "素"],
        conflict : ["肉"],
        price : 1
    },
    "八目鳗" : {
        provide : ["水产", "招牌", "鲜"],
        conflict : [],
        price : 0
    },
    "牛肉" : {
        provide : ["肉"],
        conflict : ["素"],
        price : 5
    },
    "洋葱" : {
        provide : ["素", "鲜"],
        conflict : ["肉"],
        price : 4
    },
    "南瓜" : {
        provide : ["素", "饱腹"],
        conflict : ["肉"],
        price : 5
    },
    "豆腐" : {
        provide : ["素", "家常", "清淡"],
        conflict : ["肉"],
        price : 3
    },
    "萝卜" : {
        provide : ["素", "下酒"],
        conflict : ["肉"],
        price : 6
    },
    "鳟鱼" : {
        provide : ["鲜", "水产"],
        conflict : [],
        price : 0
    },
    "猪肉" : {
        provide : ["肉"],
        conflict : ["素"],
        price : 4
    },
    "露水" : {
        provide : ["清淡"],
        conflict : [],
        price : 0
    },
    "蜂蜜" : {
        provide : ["甜"],
        conflict : [],
        price : 0
    },
    "蝉蜕" : {
        provide : ["猎奇"],
        conflict : [],
        price : 0
    },
    "土豆" : {
        provide : ["素", "家常"],
        conflict : [],
        price : 4
    },
    "野猪肉" : {
        provide : ["肉"],
        conflict : ["素"],
        price : 0
    },
    "鹿肉" : {
        provide : ["肉"],
        conflict : ["素"],
        price : -1
    },
    "黑毛猪肉" : {
        provide : ["肉", "传说", "山珍"],
        conflict : ["素"],
        price : -1
    },
    "三文鱼" : {
        provide : ["水产", "高级", "鲜"],
        conflict : [],
        price : -1
    },
    "河豚" : {
        provide : ["水产", "海味", "鲜"],
        conflict : [],
        price : -1
    },
    "鸡蛋" : {
        provide : ["生"],
        conflict : [],
        price : 1
    },
    "金枪鱼" : {
        provide : ["水产", "鲜", "高级"],
        conflict : [],
        price : -1
    },
    "蘑菇" : {
        provide : ["素", "鲜", "菌类"],
        conflict : [],
        price : -1
    },
    "辣椒" : {
        provide : ["辣"],
        conflict : [],
        price : 1
    },
    "虾" : {
        provide : ["水产", "鲜"],
        conflict : [],
        price : -1
    },
    "竹笋" : {
        provide : ["素", "清淡"],
        conflict : [],
        price : 22
    },
    "松露" : {
        provide : ["素", "传说", "山珍", "鲜", "菌类", "高级"],
        conflict : [],
        price : -1
    },
    "黄油" : {
        provide : ["重油"],
        conflict : [],
        price : -1
    },
    "幻昙华" : {
        provide : ["传说", "梦幻", "不可思议", "高级"],
        conflict : [],
        price : -1
    },
    "桃子" : {
        provide : ["果味", "甜"],
        conflict : [],
        price : -1
    },
    "和牛" : {
        provide : ["肉", "传说", "高级"],
        conflict : ["素"],
        price : -1
    },
    "冰块" : {
        provide : ["凉爽"],
        conflict : [],
        price : -1
    },
    "糯米" : {
        provide : [],
        conflict : [],
        price : -1
    },
    "竹子" : {
        provide : ["适合拍照"],
        conflict : [],
        price : -1
    },
    "白果" : {
        provide : ["适合拍照"],
        conflict : [],
        price : -1
    },
    "月光草" : {
        provide : ["不可思议", "清淡", "梦幻", "文化底蕴"],
        conflict : [],
        price : -1
    },
    "极上金枪鱼" : {
        provide : ["水产", "海味", "传说", "鲜", "高级"],
        conflict : [],
        price : -1
    },
}

// 酒水
export var wine = {
    "绿茶" : {
        provide : ["无酒精"],
        cost: 0,
        price : 1,
    },
    "雀酒" : {
        provide : ["中酒精", "可加冰", "可加热", "清酒", "辛"],
        cost: 0,
        price : 50,
    },
    "果味HB" : {
        provide : ["低酒精", "可加冰", "鸡尾酒", "西洋酒", "水果", "甘", "苦"],
        cost: 6,
        price : 12,
    },
    "淇" : {
        provide : ["低酒精", "可加冰", "清酒", "鸡尾酒", "气泡", "甘", "辛", "苦"],
        cost: 10,
        price : 18,
    },
    "果味S" : {
        provide : ["低酒精", "可加冰", "烧酒", "鸡尾酒", "水果", "甘", "苦"],
        cost: 6,
        price : 12,
    },
    "冰山毛玉冻柠" : {
        provide : ["无酒精", "直饮", "气泡", "提神", "可加冰", "甘", "水果"],
        cost: -1,
        price : 45,
    },
    "梅酒" : {
        provide : ["中酒精", "可加冰", "可加热", "利口酒", "水果"],
        cost: 20,
        price : 32,
    },
    "超Z啤酒" : {
        provide : ["低酒精", "可加冰", "啤酒", "苦"],
        cost: 11,
        price : 18,
    },
    "日月星" : {
        provide : ["中酒精", "可加冰", "可加热", "清酒", "直饮"],
        cost: 21,
        price : 34,
    },
    "牛奶" : {
        provide : ["无酒精", "直饮"],
        cost: 7,
        price : 16,
    },
    "红柚果汁" : {
        provide : ["无酒精", "水果"],
        cost: 11,
        price : 24,
    },
    "波子汽水" : {
        provide : ["无酒精", "气泡", "现代"],
        cost: 19,
        price : 30,
    },
    "冬酿" : {
        provide : ["低酒精", "甘", "可加热", "可加冰", "古典"],
        cost: -1,
        price : 60,
    },
    "大冰棍儿" : {
        provide : ["提神", "甘", "现代", "无酒精"],
        cost: 9,
        price : 35,
    },
    "晓" : {
        provide : ["高酒精", "可加冰", "西洋酒", "直饮"],
        cost: -1,
        price : 400,
    },
    "猩红恶魔" : {
        provide : ["低酒精", "可加冰", "鸡尾酒", "西洋酒"],
        cost: 22,
        price : 45,
    },
    "天狗踊" : {
        provide : ["高酒精", "可加冰", "可加热", "清酒", "直饮"],
        cost: 50,
        price : 70,
    },
    "火鼠裘" : {
        provide : ["高酒精", "可加热", "辛", "烧酒"],
        cost: -1,
        price : 420,
    },
    "风祝" : {
        provide : ["中酒精", "可加冰", "鸡尾酒", "甘", "现代"],
        cost: -1,
        price : 130,
    },
    "神之麦" : {
        provide : ["中酒精", "可加冰", "可加热", "烧酒", "直饮"],
        cost: 32,
        price : 45,
    },
    "红雾" : {
        provide : ["中酒精", "可加热", "西洋酒"],
        cost: -1,
        price : 75,
    },
    "尼格罗尼" : {
        provide : ["中酒精", "鸡尾酒", "可加冰", "水果", "苦", "西洋酒"],
        cost: -1,
        price : 100,
    },
    "教父" : {
        provide : ["高酒精", "可加冰", "鸡尾酒", "西洋酒", "苦", "古典"],
        cost: -1,
        price : 180,
    },
    "十四夜" : {
        provide : ["中酒精", "清酒", "可加冰", "可加热", "古典", "甘"],
        cost: -1,
        price : 440,
    },
    "玉露茶" : {
        provide : ["无酒精", "古典", "可加热"],
        cost: -1,
        price : 50,
    },
}

// 普通
export var custom_normal = {
    "妖怪兔" : {
        provide : ["招牌", "果味", "凉爽", "家常", "咸", "鲜", "甜", "力量涌现", "流行喜爱"],
        conflict : [],
        water: ["无酒精"]
    },
    "妖怪猫" : {
        provide : ["肉", "凉爽", "海鲜", "中华", "招牌", "流行喜爱"],
        conflict : [],
        water: ["可加冰", "啤酒", "苦"]
    },
    "妖怪狸" : {
        provide : ["肉", "重油", "咸", "饱腹", "山珍", "招牌", "流行喜爱"],
        conflict : [],
        water: ["甘", "辛"]
    },
    "妖怪狐" : {
        provide : ["肉", "招牌", "和风", "中华", "小巧", "流行喜爱"],
        conflict : [],
        water: ["直饮"]
    },
    "饕餮兽" : {
        provide : ["肉", "下酒", "山珍", "力量涌现", "流行喜爱"],
        conflict : [],
        water: ["烧酒", "清酒"]
    },
    "人类女性" : {
        provide : ["水产", "高级", "咸", "鲜", "凉爽", "招牌", "流行喜爱"],
        conflict : [],
        water: ["可加冰"]
    },
    "人类长者" : {
        provide : ["高级", "适合拍照", "灼热", "招牌", "流行喜爱"],
        conflict : [],
        water: ["低酒精"]
    },
    "座敷童子" : {
        provide : ["凉爽", "和风", "山珍", "生", "甜", "招牌", "流行喜爱"],
        conflict : [],
        water: ["低酒精", "无酒精"]
    },
    "河童" : {
        provide : ["大份", "高级", "小巧", "海味", "灼热", "猎奇", "招牌", "流行喜爱"],
        conflict : [],
        water: ["甘"]
    },
    "鸦天狗" : {
        provide : ["适合拍照", "高级", "菌类", "招牌", "流行喜爱"],
        conflict : [],
        water: ["烧酒", "清酒"]
    },
}

// 稀有
export var custom_rare = {
    "莉格露" : {
        provide : ["甜", "猎奇", "肉", "生"],
        conflict : ["素", "清淡", "凉爽"],
        water: ["低酒精", "可加冰"]
    },
    "露米娅" : {
        provide : ["生", "猎奇", "招牌", "肉", "饱腹", "流行喜爱"],
        conflict : ["下酒", "昂贵", "流行厌恶"],
        water: ["气泡", "苦"]
    },
    "橙" : {
        provide : ["水产", "烧烤", "甜", "重油", "肉", "流行喜爱"],
        conflict : ["灼热", "猎奇", "素", "流行厌恶"],
        water: ["辛", "水果"]
    },
    "稗田阿求" : {
        provide : ["文化底蕴", "甜", "流行喜爱", "高级", "清淡", "和风", "汤羹"],
        conflict : [],
        water: ["可加热", "清酒"]
    },
    "上白泽慧音" : {
        provide : ["文化底蕴", "流行喜爱", "和风", "素", "家常", "清淡", "中华"],
        conflict : ["重油", "大份", "咸", "流行厌恶"],
        water: ["清酒", "利口酒", "烧酒"]
    },
    "茨木华扇" : {
        provide : ["和风", "家常", "下酒", "文化底蕴"],
        conflict : ["实惠", "生", "辣"],
        water: ["古典", "中酒精", "直饮"]
    },
    "博丽灵梦" : {
        provide : ["实惠", "甜", "饱腹", "高级", "流行喜爱", "不可思议"],
        conflict : ["昂贵"],
        water: ["可加热", "无酒精", "低酒精"]
    },
    "伊吹萃香" : {
        provide : ["下酒", "力量涌现", "肉", "小巧", "和风"],
        conflict : ["重油"],
        water: ["高酒精", "直饮"]
    },
    "比那名居天子" : {
        provide : ["昂贵", "甜", "适合拍照", "果味", "素", "清淡", "传说"],
        conflict : ["肉", "家常"],
        water: ["鸡尾酒", "高酒精"]
    },
    "雾雨魔理沙" : {
        provide : ["传说", "和风", "灼热", "菌类", "流行喜爱"],
        conflict : ["流行厌恶"],
        water: ["可加冰", "低酒精"]
    },

}

// 特殊
export var custom_special = {
    // 森近霖之助 这个逼 (来一次我撵一次
    "森近霖之助" : {
        provide : ["鲜", "家常", "饱腹", "流行喜爱"],
        conflict : ["重油"],
        water: ["啤酒", "烧酒"]
    },
    "萌澄果" : {
        provide : ["甜", "梦幻", "肉", "水产", "流行喜爱"],
        conflict : ["猎奇", "灼热", "流行厌恶"],
        water: ["辛", "甘", "水果", "可加冰"]
    },
    "蹦蹦跳跳的三妖精" : {
        provide : ["家常", "甜", "小巧", "凉爽", "梦幻", "菌类"],
        conflict : ["灼热", "猎奇"],
        water: ["甘", "水果", "无酒精", "苦"]
    },
    "冴月麟" : {
        provide : ["流行喜爱", "家常", "辣", "水产", "中华"],
        conflict : ["重油", "生", "下酒"],
        water: ["气泡", "无酒精", "甘"]
    },
    "立空汐" : {
        provide : ["力量涌现", "肉", "山珍", "昂贵", "下酒", "和风"],
        conflict : ["素"],
        water: ["可加冰", "高酒精"]
    },
    "时焉侑" : {
        provide : ["特产", "西式", "文化底蕴", "传说", "中华", "下酒"],
        conflict : [],
        water: ["可加冰", "鸡尾酒", "西洋酒", "中酒精"]
    },
    "奸商兔" : {
        provide : ["小巧", "甜"],
        conflict : [],
        water: ["水果"]
    }
}

